; SLIME 2009-08-21
user> "yo"
"yo"
user> (+ 1 2 3)
6
user> (defn average [x y]
	(/ (+ x y) 2))
#'user/average
user> (average 3 4)
7/2
user> (.show (javax.swing.JFrame.))
nil
user> (map + [1 2 3] [4 5 6])





